Repository: lenoryv/collective.spanishdocumentation
Catalog: buildout.coredev/omegat/project_save.tmx
Source language: en_us
Languages: es_ve

source: If you have signed the contributor agreement, you can commit directly to the branch (for plone this would be the version branch, for most other packages this would be master).
es_ve: Si usted ha firmado el contributor agreement, puedes cometer directamente a la branch (para plone esto sería la versión del branch ej. la branch 4.1, para más otros paquetes esto sería el branch llamado master).

source: If you haven't written it already, this is a good time to write a test case for the bug you are fixing and make sure everything is running as it should.
es_ve: Si usted no lo ha escrito ya, este es un buen momento para escribir un caso de prueba para la falla que usted está reparando y asegúrese de que todo está funcionando como debería.

source: If you need help at any point in this process, please contact a member of the framework team personally or ask for help on the FWT mailing list XXX: link here.
es_ve: Si usted necesita ayuda en algun punto de este proceso, por favor, contacte a un miembro del equipo del framework personalmente o pida ayuda enla lista de correo FWT XXX: link here.

source: If you need help at any point in this process, please contact a member of the framework team personally or ask for help on the `FWT mailing list <https://lists.plone.org/mailman/listinfo/plone-framework-team>`_.
es_ve: Si usted necesita ayuda en algun punto de este proceso, por favor, contacte a un miembro del equipo del framework personalmente o pida ayuda en la `lista de correo FWT <https://lists.plone.org/mailman/listinfo/plone-framework-team>`_.

source: If you need help or guidance, please reach out to them as soon as possible to activate help mode.
es_ve: Si usted necesitas ayuda o asesoría, por favor, contacte a ellos lo mas pronto sea posible para activar el modo ayuda.

source: If you run into issues in this process, please see the doc :doc:`issues`.
es_ve: Si se encuentra con problemas en este proceso, consulte la documentación :doc:`issues`.

source: If you think this PLIP needs a usability review, please change the state to "please review" and add a note in the comments.
es_ve: Si usted piensa que este PLIP necesita una revisión de usabilidad, por favor, cambiar el estado a "please review" y agregue una nota a estos comentarios.

source: If you want immediate feedback, jump into IRC with the pull request link and ask for a review.
es_ve: Si usted quieres retroalimentación inmediata, valla a la sala IRC con el enlace de pull request y pedida una revisión.

source: If you want to contribute fixes, please just sign the agreement and go through the standard github pull request process described until you feel comfortable to bypass review.
es_ve: Si usted quiere contribuir a corregir, por favor firmar el acuerdo y pasar por el proceso de pull request estándar de github descrito hasta que se sienta cómodo para pasar revisión.

source: If you want to feel the process and how it works, help us review PLIPs as the implementations finish up.
es_ve: Si quieres sentir el proceso y cómo funciona, nos ayudan a revisar los PLIPs terminar las implementaciones. Si usted quiere sentir el proceso y cómo funciona, ayúdenos a revisar los PLIPs para terminar las implementaciones.

source: If you want to make large changes cleaning up whitespace or renaming variables, it is especially important to do so in a separate commit for this reason.
es_ve: Si usted quiere hacer muchos cambios sobre limpiar espacios en blanco o renombrar variables, es especialmente importante hacer una revisión separada por esta razón.

source: If you:
es_ve: Si usted:

source: If your PLIP is accepted and we haven’t seen activity in over a year, we will probably ask you to restart the whole process.
es_ve: Si su PLIP es aceptada y nosotros no vemos actividad en mas de un año, nosotros probablemente le preguntaremos para iniciar de nuevo el proceso.

source: If your bug is in more than one release (e.g. 4.1 and 4.2), please checkout both branches and add to the checkouts.cfg.
es_ve: Si su fallo esta en mas de una publicación (ej. 4.1 y 4.2), por favor, aplicar sus cambios en ambas branches y añadir al archivo checkouts.cfg.

source: If your change is minor then a ticket in the tracker will be sufficient, added as an enhancement.
es_ve: Si el cambio es menor entonces un ticket en el sistema de seguimiento debe ser suficiente, añadido como una mejora.

source: If your fix involved multiple commits, cherry-picking them one by one can get tedious.
es_ve: Si su corrección involucra múltiples revisiones, cherry-picking entonces uno a uno puede resultar tedioso.

source: If your fix only involved a single commit, you can use git's ``cherry-pick`` command to apply the same commit to a different branch.
es_ve: Su su corrección involucra una simple revisión de cambios, usted puede usar el comando git ``cherry-pick`` para aplicar la misma revisión a un branch diferente.

source: If your project is moderately complex, you may want to set up your documentation with multiple pages.
es_ve: Si su proyecto es moderadamente complejo, puedes querer instalar su documentación con páginas múltiples.

source: Implementing PLIPS ==================
es_ve: Implementando PLIPS ===================

source: Implementing Your PLIP ---------------------- You can start the development at any time - but if you are going to modify Plone itself, you might want to wait to see if your idea is approved first to save yourself some work if it isn't.
es_ve: Implementando su PLIP ---------------------- Usted puede iniciar el desarrollo en cualquier momento - pero si usted yendo a modificar el Plone en si mismo, usted podría querer esperar para ver si sus ideas son aprobadas primero para salvarse algún trabajo que no sea necesario.

source: Improvements to the curated documents can be discussed on the `plone-docs mailing list <https://lists.sourceforge.net/lists/listinfo/plone-docs>`_.
es_ve: Las mejoras a los documentos mantenidos pueden ser discutidos en la lista de correo `plone-docs <https://lists.sourceforge.net/lists/listinfo/plone-docs>`_.

source: In Python, and thus in Plone going forward, we prefer all-lowercase filenames.
es_ve: En Python, y así en Plone yendo de frente, preferimos todos los nombres de archivos en minúsculas.

source: In both methods, mr.developer will download the source from github (or otherwise) and put the package in the src directory.
es_ve: En ambos métodos, mr.developer descargará la fuente de github (o de donde se definió) y poner el paquete en el directorio src.

source: In file plips/plip-1234-widget-frobbing.cfg...::
es_ve: En el archivo plips/plip-1234-widget-frobbing.cfg...::

source: In general, anything that changes the API of Plone in the backend or UI on the front end should be filed as a PLIP.
es_ve: En general, cualquier cosa que cambia el API de Plone en el backend o la UI en la portada tendría que ser archivado como PLIP.

source: In general, we don’t want to track a PLIP for more than a year.
es_ve: En general, nosotros no queremos seguir un PLIP por mas de un año.

source: In rare circumstances, a PLIP will be rejected.
es_ve: En raras circunstancias, un PLIP sera rechazado.

source: In reality this rarely happens.
es_ve: En realidad esto rara ves sucede.

source: In that scenario, you first merge the feature branch to the 4.1 branch::
es_ve: En ese escenario, primero fusiones la branch característica a la branch 4.1::

source: In the case of the error above, all you need to do is delete the egg the system currently has.
es_ve: En el caso de que el error anterior, todo lo que necesita para eliminar del paquete egg que tiene actualmente en ell sistema.

source: In the case of the error pasted above, that would be::
es_ve: En el caso de que el error pegado encima, que sería::

source: In the end, checkouts.cfg must be configured either way so you might as well start there.
es_ve: Al final, checkouts.cfg tiene que ser configurado cualquier manera así que también podrías empezar allí.

source: In the error above, your system has buildout 1.5.1 installed and the bootstrap.py file wants to run with 1.5.2.
es_ve: En el error anterior, el sistema dispone de buildout 1.5.1 instalado y el archivo bootstrap.py quiere correr con 1.5.2.

source: In the near future, we will start asking that the seconder is either a coding partner, or someone who is willing and able to finish the PLIP should something happen to the implementor.
es_ve: En el futuro cercano, vamos a empezar a preguntar al secunde que es un socio de la codificación, o alguien que esté dispuesto y sea capaz de terminar el PLIP si algo le ocurriera al implementador.

source: In theory, by restricting which hosts you download from, buildout will go faster.
es_ve: En teoría, mediante la restricción de los hosts del cual se va a descarga, buildout irá más rápido.

source: In this case it's simplest to include it in an extended ``README.rst``.
es_ve: En este caso es más sencillo de incluir él un extendido ``README.rst``

source: In this case things are easiest if you did your fix in a separate feature branch.
es_ve: En este caso las cosas son más fáciles si usted hizo su corrección en una branch con una característica separada.

source: In this vetting process, you want to make sure that the change won’t adversely affect other people on accident.
es_ve: En este proceso de evaluación, usted quiere asegurarse de que el cambio no afectará negativamente a otras personas en un accidente.

source: Information about the open source license used for the package should be placed within the ``docs`` directory.
es_ve: Información sobre la licencia del código abierto utilizada para el paquete tendría que ser colocado dentro del directorio ``docs``.

source: Instead of running the buildout with the default buildout file, you will run the config specific to that plip::
es_ve: En vez de correr el buildout con el archivo predeterminado buildout, usted lo ejecutara el archivo especifico de configuración del plip::

source: Introduction ============ This documentation describes the process for developing Plone.
es_ve: Introducción ============ Esta documentación describes el proceso para el desarrollo en Plone.

source: Is it a PLIP or a bugfix?
es_ve: ¿Es un PLIP o una corrección de fallo?

source: Is it already an add-on and well established?
es_ve: ¿Esta listo un add-on y esta bien establecido?

source: Is it performant?
es_ve: ¿Es eficaz?

source: Is it too restrictive or not restrictive enough?
es_ve: ¿Es demasiado restrictiva o no es lo suficiente restrictivo?

source: Is there any workflow that feels odd?
es_ve: ¿Hay algún flujo de trabajo que se ofrece una experiencia extraña?

source: It also lets the reporter know that you care.
es_ve: Eso también le permite al reportero saber que usted preocupa.

source: It can be a little daunting at first to find out which packages are causing the bug in question, but just ask on irc if you need some help.
es_ve: Puede ser un poco intimidante al principio para averiguar qué paquetes están causando el fallo en cuestión, pero sólo pregunte en el IRC si necesitas algo de ayuda.

source: It includes topics like:
es_ve: Este incluye temas como los siguientes:

source: It is a change to a Plone package that would affect everyone.
es_ve: Eso es cuando un cambio a un paquete Plone que afectaría todo el mundo

source: It is often the case that there are competing implementations and we want to see it vetted as an add on before “blessing” a preferred implementation.
es_ve: A menudo, es el caso que hay implementaciones compitiendo y nosotros queremos ver eso evaluado como un añadido antes de recibir la "bendición" la implementación preferida.

source: It is primarily a technical resource for setting up your core developer buildout, fixing bugs, and writing plips.
es_ve: Esto es principalmente un recurso técnico para instalar su buildout del core developer, corregir fallos, y escribir plips.

source: It is very rare that the “Risks” section will be empty or none.
es_ve: Es muy rara ves que la sección de “Risks” estará vacío o nula.

source: It runs every half an hour and takes a while to run so checking back in an hour is a safe bet.
es_ve: Se ejecuta cada media hora y tarda un rato para ejecutar la comprobación en una hora es una apuesta segura.

source: It should be formatted using `reStructuredText (reST) <http://docutils.sourceforge.net/rst.html>`_ in order to get formatted properly by those systems.
es_ve: Este tendrá que ser formateado utilizando `reStructuredText (reST) <http://docutils.sourceforge.net/rst.html>`_ para conseguir el formato apropiado por aquellos sistemas.

source: It should look something like this:
es_ve: Esto debería lucir algo así como lo siguiente:

source: It will be included on the PyPI page for your egg, and on the front page of its github repository.
es_ve: Este será incluido en la página PyPI en su paquete Egg, y en la página de su repositorio github.

source: I’m still nervous.
es_ve: Yo aun estoy nervioso.

source: Jenkins ------- You STILL aren't done!
es_ve: Jenkins ------- ¡Usted TODAVÍA no está listo!

source: Just because a PLIP isn’t accepted in core doesn’t mean it’s a bad idea.
es_ve: Solo por que un PLIP no ha sido aceptado en núcleo no significa que sea una mala idea.

source: Just sending in a contributors agreement does not guarantee you access to the repository, but once you send it in we will always have it on file for when you are ready to contribute.
es_ve: El enviar el acuerdo de contribuciones (contributors agreement) no garantiza que se otorguen acceso al repositorio, pero una vez que lo envía siempre lo tenemos en el archivo para cuando usted está listo para contribuir.

source: Keep in mind that champions are in passive mode by default.
es_ve: Ten en mente que los defensores están en modo pasivo por defecto.

source: Let's do that now::
es_ve: Hacerlo ahora así::

source: Let's say the bug starts in 4.1.
es_ve: Por ejemplo el fallo inicia en la versión 4.1.

source: Let's take this one for example::
es_ve: Déjeme darle un ejemplo de esto::

source: Licenses
es_ve: Licencias

source: Make sure to install this into the proper python environment.
es_ve: Debe asegurarse instalar esto dentro de su apropiado entorno python.

source: Make sure to let us know you intend to review the PLIP by joining the Framework Team mailing list (XXX:link) and sending a quick email.
es_ve: Asegurese de decirnos como usted intenta revisar el PLIP uniendose a la lista de correo del equipo de Framework (XXX:link) y enviar un correo rapidamente.

source: Make sure to let us know you intend to review the PLIP by joining the `Framework Team mailing list <https://lists.plone.org/mailman/listinfo/plone-framework-team>`_ and sending a quick email.
es_ve: Asegúrese de decirnos como usted intenta revisar el PLIP uniéndose a la `lista de correo del equipo de Framework <https://lists.plone.org/mailman/listinfo/plone-framework-team>`_ y enviar un correo rápidamente.

source: Make sure to rerun buildout if you were in a different branch earlier to get the correct versions of packages, otherwise you will get some weird behavior!
es_ve: ¡Asegúrese de volver a ejecutar buildout si estuviera en una branch diferente antes para obtener las versiones correctas de los paquetes, de lo contrario obtendrá un comportamiento extraño!

source: Make sure you are logged in and please specify "core" not collective on the trac ticket, your github username, and select the CoreAccess component.
es_ve: Asegúrese de que este registrado e iniciado en su sesión de usuario y por favor especifique "core" y no collective en su ticket en el sistema trac, su nombre de usuario github, y selecciones el componente CoreAccess.

source: Make sure your egg is above that line or your egg probably won't get made very quickly.
es_ve: Asegúrese que su paquete egg este por encima de esa línea o su paquete egg probablemente no se hizo muy rápidamente.

source: Merging the PLIP in is not the hardest part, but you must think about it when you develop.
es_ve: La fusión de la PLIP no es la parte más difícil, pero hay que pensar en ello cuando se desarrolla.

source: Missing PIL ^^^^^^^^^^^ pil.cfg is include within this buildout to aid in PIL installation.
es_ve: PIL perdido ^^^^^^^^^^^ El archivo pil.cfg es incluido con esta configuración buildout para ayudar en instalación PIL.

source: Modified Egg Issues ^^^^^^^^^^^^^^^^^^^ bin/develop status is showing that the Products.CMFActionIcons egg has been modified, but I haven't touched it.
es_ve: Incidencias con paquetes egg modificado ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^ El comando bin/develop status el mostrara que el paquete egg Products.CMFActionIcons ha sido modificado, but I haven't touched it.

source: Modifying checkouts.cfg also triggers the buildbot, jenkins, to pull in the egg and run all the tests against the changes you just made.
es_ve: Modifique el archivo checkouts.cfg también ejecute el buildbot, entonces el servicio jenkins, actualizara el paquete egg y ejecutara todas las pruebas contra las pruebas que usted realizo.

source: More info on IRC can be found at http://plone.org/support/chat.
es_ve: Mas información sobre el servicio de IRC puede ser encontrada en el siguiente enlace http://plone.org/support/chat.

source: More information on switching release branches is below.
es_ve: Más información en el cambio de ramas de liberación a continuación.

source: More on that below.
es_ve: Más sobre esto a continuación.

source: Most of our developers work there and you will get the best advice there.
es_ve: La mayoría de nuestros desarrolladores trabajan allí y obtendrá el mejor consejo desde allí.

source: Naming Conventions ------------------ Above all else, be consistent with any code your are modifying!
es_ve: Convenciones de nombre ---------------------- ¡Por encima de todo, ser coherente con cualquier código que usted está modificando!

source: Navigate to this branch in the github UI and on the top right there will be a button that says "Pull Request".
es_ve: Vaya a esta branch de la interfaz de usuario github y en la parte superior derecha habrá un botón que dice "Pull Request".

source: No matter how you approach it, you should ALWAYS run test cases for both the module and plone.org before commiting any changes.
es_ve: Ningún asunto cómo te lo acercas, usted tiene que SIEMPRE probar la ejecución de los test cases para ambos el módulo y plone.org antes de que generar una revisión con cualquiera de cambios.

source: Not that you would ever skip running all tests of course...
es_ve: No sea que alguna vez volvería a sáltate ejecutar todas las pruebas, por supuesto...

source: Note that there is a section seperator called "# Test Fixes Only".
es_ve: Tenga en cuenta que hay una separador de sección llamada "# Test Fixes Only".

source: Nothing is too big nor small.
es_ve: Nada es demasiado grande ni pequeño.

source: Once that is done pulling down eggs, You can start your new instance with::
es_ve: Una vez que se hace ejecutado el buildout, usted puede comenzar su nueva instancia Zope con el siguiente comando::

source: Once you [think you] know which package(s) you want, we need to pull the source.
es_ve: Una vez que [cree] saben cuál es el paquete(s) que desea, tenemos que obtener de la fuente del mismo.

source: Once you become a master of bugfixes, you may just let jenkins do this part for you.
es_ve: Una ves se allá convertido en el maestro de corrección de fallas, usted tal ves le deje al servicio de jenkins hacer esta tarea por usted.

source: Once you have familiarized yourself with the community and you are excited to contribute to the core:
es_ve: Una vez te se allá familiarizado usted mismo con la comunidad y usted está entusiasmado para contribuir al núcleo:

source: Once you have finished, please update your PLIP ticket to indicate that it is ready for review.
es_ve: Una ves que allá finalizado, por favor, actualice su ticket indicar que esta listo para ser revisado.

source: One other thing of note is that running bootstrap effectively ties that python executable and all of its libraries to your buildout.
es_ve: Otra cosa de la nota es que está ejecutando bootstrap efectivamente asocia al ejecutable python y todas sus bibliotecas a su buildout.

source: Or, you may need to make sure you run 'bin/buildout …' after 'bin/develop …'.
es_ve: O, usted tal ves necesitar asegurarse que usted ejecuto el script 'bin/buildout …' después ejecutar el script 'bin/develop …'.

source: Other Random Issues ------------------- ..
es_ve: Otros incidentes aleatorios --------------------------- ..

source: Others may be able to point out risks or even offer up better or existing solutions.
es_ve: Otros pueden ser capaces de señalar puntos de riegos o incluso ofrecer una mejor o soluciones existentes.

source: Otherwise, please create a pull request (more on that below).
es_ve: De lo contrario, por favor, haga un fork del repositorio aplicando sus revisiones allí y luego haga un pull request (mas abajo se explica como).

source: PLIP is approved for inclusion into core for a given release #.
es_ve: PLIP es aprobada para incluirse dentro de núcleo para ser dado en una publicación #.

source: PLIP is approved for merge.
es_ve: El PLIP es aprobada para fusionarse.

source: PLIP is submitted for review by developer #.
es_ve: PLIP es presentado para ser revisado por un desarrollador #.

source: PLIPs are not just for code monkeys.
es_ve: Las PLIPs no solamente son código fuente monkeys.

source: PLIPs go through a different process than bug fixes because of their broad reaching effect.
es_ve: Las PLIPs van por un proceso diferente que la corrección de fallos debido a su ancho logrando efecto.

source: Please also prioritize the ticket.
es_ve: Por favor, también priorizar el ticket.

source: Please check jenkins to make sure your changes haven't borked things.
es_ve: Por favor, compruebe que el servicio jenkins se asegure que sus cambios no hallan roto cosas.

source: Please don't check in anything that doesn't!
es_ve: ¡Por favor, no verifique nada adicional!

source: Please make sure to validate all warnings and errors before committing to make sure the documents remain valid.
es_ve: Por favor asegúrese en validar todos los avisos y los errores antes de generar una revisión para estar seguro que los documentos queden válido.

source: Please note a few things.
es_ve: Por favor, note un par de cosas.

source: Please report bugs/issues in Trac as you would for any Plone bug.
es_ve: Por favor, reporte fallos/incidencias en el sistema de ticket Trac como si se tratara de cualquier fallo Plone.

source: Please use the template provided (XXX: put the template here?
es_ve: Por favor, use la plantilla proveída (XXX: put the template here?

source: Plone's source code is hosted in a git repository at https://github.com/plone, but only members of the developer team have commit-rights.
es_ve: El código de fuente de Plone es hospedado en un repositorio git en https://github.com/plone, solo para los miembros del equipo de desarrollado que tienen derecho de hacer revisiones.

source: Proceed as normal.
es_ve: Proceda como de costumbre.

source: Process Overview ---------------- #.
es_ve: Información general del proceso ------------------------------- #.

source: Pull the 4.1 branch and fix and commit there with tests.
es_ve: Obtenga la branch 4.1 y aplicar sus cambios allí con varias revisiones por cada cambio con sus respectivos tests.

source: Python, like any programming language, can be written in a number of styles.
es_ve: Python, como cualquier lenguaje de programación, puede ser escrito en un número de estilos.

source: READ: this is how your fix becomes an egg!
es_ve: LEER: esto es como su corrección viene en un paquete egg!
